CSI API ETABS v1
cOAPI.Unhide Method
 This function unhides the application, that is, it makes it visible. When the application is hidden, it is not visible on the screen or on the Windows task bar.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Unhide()
Function Unhide As Integer
Dim instance As cOAPI
Dim returnValue As Integer
returnValue = instance.Unhide()
int Unhide()
abstract Unhide : unit -> int
Return Value
Type: Int32
The function returns zero if the application is successfully unhidden (set visible) and nonzero if the function fails. If the application is already visible (not hidden) calling this function returns an error.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'hide application
       ret = SapObject.Hide
   'unhide application
       ret = SapObject.Unhide
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cOAPI Interface
ETABSv1 Namespace